Enterprise_Serivces/Prod/Bronze1/AllSparkCSRChannel/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IAllSparkAgentService/DeliverOrder</wsa:Action><wsa:MessageID>uuid:e6005281-971a-4592-8377-04e86b9db41d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://allsparkcsrchannelqa1.testgs.pvt/AllSparkAgentService.svc</wsa:To></soap:Header><soap:Body><DeliverOrder xmlns="http://tempuri.org/"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><PartnerKey xmlns="http://www.gamestop.com/services/channel/allsparkservice/csr/contracts/messages/2010/10">TEST-US</PartnerKey><OrderRequestGUID xmlns="http://www.gamestop.com/services/channel/allsparkservice/csr/contracts/messages/2010/10">9d997eb9-0378-41ea-9a23-784e2c84f6fe</OrderRequestGUID></request></DeliverOrder></soap:Body></soap:Envelope>